{
  "books": [
    {
      "name": "ipsum non dolor",
      "author": "Foreman Cooley",
      "pages": 246,
      "price": "$13.36",
      "picture": "https://placehold.it/200x250",
      "genre": "Cookbook",
      "publication": "ISBOL",
      "publishedDate": "2015-12-07",
      "description": "Aute consequat enim ut nisi. Nostrud enim minim duis qui magna et laboris reprehenderit culpa tempor ad incididunt anim. Eiusmod qui Lorem in fugiat Lorem elit commodo Lorem do in. Excepteur excepteur et sunt sit dolore consequat. Ex pariatur sit eiusmod minim.\r\n",
      "id": "5ca0f0465b7683a12c6e143c"
    },
    {
      "id": "5ca0f046dd6c0b65588ef3d8",
      "name": "dolore enim enim",
      "author": "Sheila Peterson",
      "pages": 369,
      "price": "$27.15",
      "picture": "https://placehold.it/200x250",
      "genre": "History",
      "publication": "ENERVATE",
      "publishedDate": "2017-12-22",
      "description": "Duis consequat duis minim exercitation enim occaecat culpa occaecat consequat exercitation. Adipisicing anim amet aliquip ea consectetur magna in occaecat magna id aute. Nisi proident enim consectetur tempor adipisicing ut quis. Enim incididunt voluptate ipsum aliquip occaecat aute fugiat in. Consequat sint labore pariatur cillum incididunt ullamco magna adipisicing dolore consequat.\r\n"
    },
    {
      "id": "5ca0f046ef83fba23e594b49",
      "name": "est cupidatat et",
      "author": "Florence Gamble",
      "pages": 301,
      "price": "$60.43",
      "picture": "https://placehold.it/200x250",
      "genre": "Fantasy",
      "publication": "ZILLACOM",
      "publishedDate": "2014-08-17",
      "description": "Velit duis non velit officia cupidatat consequat incididunt esse esse veniam culpa minim duis ut. Et sint aute reprehenderit est veniam in duis ea ullamco fugiat deserunt. Cillum pariatur ipsum mollit in aliquip. Nulla officia nulla sit labore exercitation qui aute eiusmod ut reprehenderit consequat esse dolore sit. Fugiat aliquip aliqua ipsum anim ea do est magna in aute elit aliqua. In dolor fugiat sit reprehenderit sint officia non ullamco. Ut ullamco aliquip sunt veniam excepteur adipisicing est eiusmod dolore sint Lorem id ipsum adipisicing.\r\n"
    },
    {
      "id": "5ca0f04639ab22644342c57a",
      "name": "duis excepteur consequat",
      "author": "Stevenson Allen",
      "pages": 200,
      "price": "$77.40",
      "picture": "https://placehold.it/200x250",
      "genre": "Action and adventure",
      "publication": "QUARX",
      "publishedDate": "2014-12-26",
      "description": "Proident fugiat esse pariatur laboris magna id. Tempor et irure qui esse ut consequat qui nostrud. Pariatur elit eu duis cupidatat non aliqua proident do consequat consectetur. Enim fugiat Lorem aute adipisicing esse irure ad ut deserunt elit.\r\n"
    },
    {
      "id": "5ca0f046b6471bbb8ab5a3cf",
      "name": "consectetur nisi ad",
      "author": "Lillie Stokes",
      "pages": 245,
      "price": "$21.77",
      "picture": "https://placehold.it/200x250",
      "genre": "Action and adventure",
      "publication": "ZILLACTIC",
      "publishedDate": "2014-05-24",
      "description": "Laboris labore amet laborum nisi in in proident pariatur. Esse ut nisi qui magna aliquip elit cillum sit veniam ea. In sit fugiat veniam commodo tempor non sunt nisi nostrud.\r\n"
    },
    {
      "id": "5ca0f0464ebed45584595393",
      "name": "veniam sint reprehenderit",
      "author": "Cynthia Fields",
      "pages": 268,
      "price": "$53.86",
      "picture": "https://placehold.it/200x250",
      "genre": "Biography",
      "publication": "ZILODYNE",
      "publishedDate": "2018-03-01",
      "description": "Veniam exercitation aliqua in Lorem enim dolor labore ullamco. Deserunt cillum fugiat eiusmod qui nisi commodo exercitation quis ullamco et dolore ullamco. Ullamco esse amet commodo non id enim incididunt enim tempor et. Qui reprehenderit labore est nostrud excepteur adipisicing labore sunt pariatur. Nostrud cupidatat cupidatat ad labore exercitation qui nostrud in sint do. Dolor amet do laboris minim do irure deserunt qui deserunt excepteur in. Esse magna deserunt ex ut aliqua.\r\n"
    },
    {
      "id": "5ca0f0466d7a56a56b9d9c80",
      "name": "reprehenderit minim et",
      "author": "Imelda Simpson",
      "pages": 291,
      "price": "$90.87",
      "picture": "https://placehold.it/200x250",
      "genre": "Poetry",
      "publication": "VELOS",
      "publishedDate": "2014-06-18",
      "description": "Aliqua reprehenderit nulla proident labore ipsum irure proident pariatur officia est consequat. Ad nostrud est in aute enim esse exercitation ex. Mollit duis culpa nisi dolore enim sit. Consequat minim et excepteur adipisicing id sit cillum deserunt culpa magna voluptate in do laborum. Sit ipsum duis labore proident sunt non Lorem sit nulla minim ut tempor est.\r\n"
    },
    {
      "id": "5ca0f046197eb2417dfc3374",
      "name": "nulla fugiat culpa",
      "author": "Glenna Glover",
      "pages": 289,
      "price": "$23.48",
      "picture": "https://placehold.it/200x250",
      "genre": "Art",
      "publication": "KONNECT",
      "publishedDate": "2018-01-26",
      "description": "Cillum sint magna reprehenderit nisi deserunt est aute sit fugiat exercitation. Fugiat est do enim sit. Proident laborum est incididunt ipsum enim aliqua magna ullamco est non sit sunt ipsum. Officia excepteur minim id proident. Consectetur veniam velit consequat excepteur laboris ut sint incididunt aute. Tempor irure tempor veniam proident ipsum aliqua quis ullamco aute magna. Commodo fugiat cillum ipsum nostrud adipisicing culpa veniam.\r\n"
    },
    {
      "id": "5ca0f046715a32f3d4332d80",
      "name": "in reprehenderit culpa",
      "author": "Sabrina Hubbard",
      "pages": 224,
      "price": "$40.55",
      "picture": "https://placehold.it/200x250",
      "genre": "History",
      "publication": "INRT",
      "publishedDate": "2017-11-10",
      "description": "Ut ut do aliqua Lorem nulla. Ex pariatur anim proident cillum mollit elit anim. Sint culpa fugiat aliquip eiusmod cillum in cupidatat cupidatat adipisicing quis dolore et. Quis laboris incididunt veniam ex laborum adipisicing enim et culpa laboris deserunt. Eu irure exercitation exercitation aute irure enim dolore sunt veniam labore velit. Laborum quis ex non officia adipisicing in culpa reprehenderit eu consectetur excepteur cupidatat nulla dolore.\r\n"
    },
    {
      "id": "5ca0f0468e3934e2b1eb2a54",
      "name": "sint magna consectetur",
      "author": "Burke Navarro",
      "pages": 238,
      "price": "$30.94",
      "picture": "https://placehold.it/200x250",
      "genre": "Cookbook",
      "publication": "ROTODYNE",
      "publishedDate": "2016-05-05",
      "description": "Culpa aliquip in pariatur nisi magna ad sint exercitation Lorem dolore laboris. Voluptate enim excepteur dolor consequat ullamco eiusmod culpa laboris consectetur. Id eu ut occaecat ea laborum excepteur cillum voluptate sint mollit veniam officia. Ut fugiat nisi esse aliqua veniam nulla proident pariatur veniam sint occaecat eu quis. Enim ex commodo aliqua quis tempor enim. Sit labore exercitation nulla id velit id mollit ad eiusmod nostrud sit irure tempor occaecat. Ullamco eiusmod Lorem occaecat nulla magna consectetur adipisicing commodo magna consectetur excepteur ullamco aute nisi.\r\n"
    },
    {
      "id": "5ca0f0468024e7c750bea183",
      "name": "ad enim et",
      "author": "William Parsons",
      "pages": 383,
      "price": "$94.28",
      "picture": "https://placehold.it/200x250",
      "genre": "Action and adventure",
      "publication": "RODEMCO",
      "publishedDate": "2016-03-26",
      "description": "Dolore quis ea ullamco cillum adipisicing duis ad proident. Labore non mollit reprehenderit anim tempor culpa proident officia velit quis esse fugiat aliquip. Do ad laborum elit laboris et anim enim. Eu quis proident enim laborum voluptate sint officia voluptate reprehenderit minim Lorem quis voluptate. Fugiat aliquip cillum veniam ipsum ut laborum dolore esse adipisicing tempor dolor. Incididunt qui nostrud mollit minim mollit esse pariatur pariatur tempor dolore.\r\n"
    },
    {
      "id": "5ca0f0469fbf087ac4abd0a2",
      "name": "cupidatat reprehenderit enim",
      "author": "Rebecca Camacho",
      "pages": 267,
      "price": "$55.76",
      "picture": "https://placehold.it/200x250",
      "genre": "Cookbook",
      "publication": "BOINK",
      "publishedDate": "2017-02-17",
      "description": "Ipsum sint velit duis do nulla sunt. Ea tempor duis labore irure laborum exercitation anim ad. Dolor proident nulla ullamco ex dolore officia irure minim. Incididunt irure Lorem est adipisicing excepteur excepteur labore officia. Aliquip laborum proident officia ipsum laborum commodo est ex dolor exercitation. Ullamco tempor pariatur reprehenderit velit aute esse voluptate sint. Nulla proident consequat duis ex amet laboris voluptate consequat id voluptate fugiat commodo.\r\n"
    },
    {
      "id": "5ca0f046f81d9dacf992551a",
      "name": "esse voluptate veniam",
      "author": "Dominique Espinoza",
      "pages": 285,
      "price": "$58.10",
      "picture": "https://placehold.it/200x250",
      "genre": "Biography",
      "publication": "NORALEX",
      "publishedDate": "2018-08-18",
      "description": "Reprehenderit consequat consequat elit reprehenderit duis amet. Nostrud tempor adipisicing qui et magna consectetur et anim ea. Laboris occaecat consequat laboris do ea nulla Lorem laborum. Aute fugiat voluptate fugiat laboris incididunt non sit aute velit consectetur sint culpa ut. Duis et adipisicing nisi labore ea. Aute occaecat aute aliquip dolor.\r\n"
    },
    {
      "id": "5ca0f046295584f5c52d8c01",
      "name": "esse deserunt eu",
      "author": "Foster Fernandez",
      "pages": 281,
      "price": "$36.12",
      "picture": "https://placehold.it/200x250",
      "genre": "Biography",
      "publication": "DREAMIA",
      "publishedDate": "2017-10-04",
      "description": "Pariatur qui officia pariatur voluptate anim magna do. Ad aliquip consequat do excepteur Lorem magna dolor. Et in reprehenderit eiusmod excepteur consequat ex adipisicing veniam Lorem quis.\r\n"
    },
    {
      "id": "5ca0f0468cbfaa56b461d939",
      "name": "laborum exercitation et",
      "author": "Collier King",
      "pages": 300,
      "price": "$47.57",
      "picture": "https://placehold.it/200x250",
      "genre": "Drama",
      "publication": "MAGNEATO",
      "publishedDate": "2014-01-09",
      "description": "Ea adipisicing exercitation mollit ipsum laboris deserunt eu sit non est reprehenderit. Sunt excepteur Lorem deserunt laborum proident elit in aliquip ea ex ad culpa exercitation culpa. Non excepteur ea est consequat mollit velit labore exercitation labore et labore officia commodo.\r\n"
    },
    {
      "id": "5ca0f046022b9f7623f34cf1",
      "name": "cillum id sunt",
      "author": "Pamela Talley",
      "pages": 339,
      "price": "$19.48",
      "picture": "https://placehold.it/200x250",
      "genre": "Biography",
      "publication": "DOGNOSIS",
      "publishedDate": "2017-02-09",
      "description": "Est dolor nisi consectetur id consequat ex. Consequat in aliqua labore eiusmod et cillum labore aliquip aliquip enim fugiat proident cupidatat. In enim nisi incididunt sit tempor consectetur deserunt occaecat in aliqua nostrud. Aliqua voluptate quis mollit non velit dolore occaecat eiusmod.\r\n"
    },
    {
      "id": "5ca0f046d8c1ddf09a63c007",
      "name": "ipsum ad dolor",
      "author": "Lopez Myers",
      "pages": 263,
      "price": "$29.54",
      "picture": "https://placehold.it/200x250",
      "genre": "Art",
      "publication": "STEELFAB",
      "publishedDate": "2017-08-18",
      "description": "Occaecat in culpa do consectetur culpa aute culpa eu voluptate proident et et. Aliquip deserunt exercitation dolor exercitation fugiat. Consequat laborum dolore ut aliqua occaecat commodo excepteur ad consequat. Consequat duis mollit sunt eiusmod dolor amet nisi id officia pariatur voluptate tempor fugiat sit. Consequat dolore nisi anim mollit eiusmod duis amet id culpa voluptate.\r\n"
    },
    {
      "name": "new book",
      "author": "soumya",
      "pages": 100,
      "price": "$100",
      "picture": "https://placehold.it/200x250",
      "genre": "Art",
      "publication": "XYZ",
      "publishedDate": "2019-03-07",
      "description": "test description",
      "id": "87518adc-fc99-4469-84e1-bb0172cf9c9e"
    },
    {
      "name": "book 1",
      "author": "Soumya",
      "pages": 100,
      "price": "$105",
      "picture": "https://placehold.it/200x250",
      "genre": "Art",
      "publication": "XYZ",
      "publishedDate": "2018-12-19",
      "description": "test description",
      "id": "6c3af683-2e60-4060-ab46-30b87ae050c1"
    }
  ]
}